; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v6)
		(pred_2 ?v5)
		(pred_3 ?v4)
		(pred_6 ?v4)
		(pred_1 ?v5 ?v4)
		(pred_4)
		(pred_5 ?v5))

   (:action op_3
       :parameters  (?v2 ?v7)
       :precondition (and (not-eq ?v2 ?v7) 
                          (pred_3 ?v2) (pred_3 ?v7) (pred_6 ?v2))
       :effect (and  (pred_6 ?v7)
		     (not (pred_6 ?v2))))


   (:action op_2
       :parameters (?v1 ?v8)
       :precondition  (and  (pred_2 ?v1) (pred_3 ?v8)
			    (pred_1 ?v1 ?v8) (pred_6 ?v8) (pred_4))
       :effect (and (pred_5 ?v1)
		    (not (pred_1 ?v1 ?v8)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v1  ?v8)
       :precondition  (and  (pred_2 ?v1) (pred_3 ?v8)
			    (pred_5 ?v1) (pred_6 ?v8))
       :effect (and (pred_1 ?v1 ?v8)
		    (pred_4)
		    (not (pred_5 ?v1)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_01 obj_05 
          obj_04 obj_02 
)
(:init
(pred_3 obj_03)
(pred_3 obj_01)
(pred_3 obj_05)
(pred_2 obj_04)
(pred_2 obj_02)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_01)
(pred_4)
(pred_1 obj_04 obj_03)
(pred_1 obj_02 obj_03)
(pred_6 obj_03)
)
(:goal
(and
(pred_1 obj_04 obj_05)
(pred_1 obj_02 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_04 obj_05) (pred_6 obj_01))
    (sometime-before  (pred_1 obj_02 obj_05) (pred_6 obj_01))
  )
)
)

; plan
1. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04 obj_03) (pred_4)
   added: (pred_5 obj_04)
   goals met: 0 of 2
2. (op_3 obj_03 obj_01)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_01)
   goals met: 0 of 2
3. (op_1 obj_04 obj_01)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_01) (pred_4)
   goals met: 0 of 2
4. (op_3 obj_01 obj_03)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_03)
   goals met: 0 of 2
5. (op_2 obj_02 obj_03)
   deleted: (pred_1 obj_02 obj_03) (pred_4)
   added: (pred_5 obj_02)
   goals met: 0 of 2
6. (op_3 obj_03 obj_05)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_05)
   goals met: 0 of 2
7. (op_1 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02 obj_05) (pred_4)
   goals met: 1 of 2
8. (op_3 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_01)
   goals met: 1 of 2
9. (op_2 obj_04 obj_01)
   deleted: (pred_1 obj_04 obj_01) (pred_4)
   added: (pred_5 obj_04)
   goals met: 1 of 2
10. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 1 of 2
11. (op_1 obj_04 obj_05)
   deleted: (pred_5 obj_04)
   added: (pred_1 obj_04 obj_05) (pred_4)
   goals met: 2 of 2
